OpenDTEF-v2012/tutorials/verificationAndValidation/icoReactingMultiphaseInterFoam/stefanProblem/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseChangeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    massTransferMultiphaseSystem;

phases  (liquid gas);

liquid
{
    type            pureMovingPhaseModel;
}

gas
{
    type            pureMovingPhaseModel;
}

surfaceTension
(
    (gas and liquid)
    {
        type            constant;
        sigma           0.0;
    }
);

massTransferModel
(
    (liquid to gas)
    {
        type            Lee;
        C               1700;
        Tactivate       373.25;
    }
);

// ************************************************************************* //
