OpenDTEF-v2012/tutorials/verificationAndValidation/icoReactingMultiphaseInterFoam/stefanProblem/constant/thermophysicalProperties.gas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

// ************************************************************************* //

mixture
{
    specie
    {
        nMoles      1;
        molWeight   18.9;
    }
    equationOfState
    {
        rho         0.581;
    }
    thermodynamics
    {
        Hf          0;//-1.338e7; //[J/kg]
        Cp          2030;
    }
    transport
    {
        mu          0.9e-05;
        Pr          0.7;
    }
}


// ************************************************************************* //
