OpenDTEF-v2012/tutorials/verificationAndValidation/icoReactingMultiphaseInterFoam/stefanProblem/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 1;
        cAlphas          ((liquid and gas) 0.1);

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    rho
    {
        solver           diagonal;
        tolerance       1e-7;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-9;
        relTol           0.001;
        smoother         DIC;
    }

    mDotSmearFinal
    {
        solver           PCG;
        tolerance        1e-6;
        preconditioner   DIC;
        relTol           0.00;
        smoother         DIC;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-9;
        relTol           0;
        minIter 10;
    }

    pcorrFinal
    {
        $p_rgh;
        tolerance        1e-9;
        relTol           0;
    }


    "(U|h|T.*|k|epsilon|R)"
    {
        solver           smoothSolver;
        smoother         symGaussSeidel;
        tolerance        1e-8;
        relTol           0.01;
    }

    "(U|h|T.*|k|epsilon|R)Final"
    {
        $U;
        tolerance        1e-8;
        relTol           0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nCorrectors         4;
    nOuterCorrectors    1;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        ".*"           1;
    }
}

// ************************************************************************* //
