OpenDTEF-v2012/tutorials/verificationAndValidation/icoReactingMultiphaseInterFoam/stefanProblem/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
restore0Dir

# copy 0 folder to 1.36
cp -r 0 1.36
cp system/setAlphaFieldDict.liquid system/setAlphaFieldDict
runApplication setAlphaField
rm log.setAlphaField

cp system/setAlphaFieldDict.gas system/setAlphaFieldDict
runApplication setAlphaField

runApplication $(getApplication)

./plotGraph

#------------------------------------------------------------------------------
